Repository: CofficLab/GitOK
Catalog: Packages/PluginCommitForm/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Auto summary
zh_hans: 自动摘要
zh_hk: 自動摘要

source: Commit
zh_hans: 提交
zh_hk: 提交

source: Conventional Style
zh_hans: Conventional 风格
zh_hk: Conventional 風格

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Craft a subject, body, and any trailers.
zh_hans: 撰写主题、正文与任意尾注。
zh_hk: 撰寫主題、正文與任意尾註。

source: GitOK runs the commit and refreshes the tree.
zh_hans: GitOK 执行提交并刷新工作树。
zh_hk: GitOK 執行提交併刷新工作樹。

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Message Editor
zh_hans: 消息编辑器
zh_hk: 消息編輯器

source: Pick the changes to include in this commit.
zh_hans: 选择要包含进本次提交的改动。
zh_hk: 選擇要包含進本次提交的改動。

source: Safe
zh_hans: 安全
zh_hk: 安全

source: Stage
zh_hans: 暂存
zh_hk: 暫存

source: Subject, body, and trailers with live length guidance.
zh_hans: 主题、正文与尾注，带实时长度提示。
zh_hk: 主題、正文與尾註，帶實時長度提示。

source: The exact staged content is shown before you commit.
zh_hans: 提交前清晰展示将要提交的暂存内容。
zh_hk: 提交前清晰展示將要提交的暫存內容。

source: Type, scope, and summary templates follow Conventional Commits.
zh_hans: 类型、作用域与摘要模板遵循 Conventional Commits。
zh_hk: 類型、作用域與摘要模板遵循 Conventional Commits。

source: What You See
zh_hans: 所见即所得
zh_hk: 所見即所得

source: Write great commits without leaving the keyboard.
zh_hans: 不离开键盘，写出漂亮的提交。
zh_hk: 不離開鍵盤，寫出漂亮的提交。

source: Write the message
zh_hans: 撰写消息
zh_hk: 撰寫消息

source: click to commit
zh_hans: 一键提交
zh_hk: 一鍵提交

source: coverage
zh_hans: 覆盖率
zh_hk: 覆蓋率

source: Add
zh_hans: 添加

source: Add Co-author
zh_hans: 添加共同作者

source: Cancel
zh_hans: 取消

source: Close
zh_hans: 关闭

source: Co-authors
zh_hans: 共同作者

source: Commit & Push
zh_hans: 提交并推送

source: Commit failed
zh_hans: 提交失败

source: Commit operation failed
zh_hans: 提交操作失败

source: Copy error
zh_hans: 复制错误

source: Done
zh_hans: 完成

source: Email
zh_hans: 邮箱

source: Fetch failed
zh_hans: 获取失败

source: Git error details
zh_hans: Git 错误详情

source: Git user not configured
zh_hans: 未配置 Git 用户

source: Merge failed
zh_hans: 合并失败

source: Name
zh_hans: 姓名

source: Push failed
zh_hans: 推送失败

source: commit
zh_hans: 提交信息

source: Submitting...
zh_hans: 正在提交…
